import time

def task2(robot):
    # 狗头对齐在第一个箱子处，目标前进350+40左右
    # 这个move会自动开启移动模式
    robot.move(last_time=10, vx=20000)
    time.sleep(0.5)

    # 狗头超过第二个箱子差不多40的位置，目标原地左转弯
    # 这个左转90内置了2秒的sleep和停止（我暂且认为这个停止是变成了原地模式）
    robot.revolve_90_l()
    time.sleep(0.5)
    # robot.move(last_time=3, vx=-20000)
    # time.sleep(0.5)
    #
    # # ----------------------第一个箱子----------------------
    # # ----------------------first_仪表盘----------------------
    # robot.move(last_time=2, vy=-20000)
    # time.sleep(0.5)
    #
    # # ----------------------第二个箱子----------------------
    # # ----------------------second_仪表盘----------------------
    # robot.move(last_time=5, vy=-20000)
    # time.sleep(0.5)
    #
    # # ----------------------第一个箱子----------------------
    # # ----------------------third_仪表盘----------------------
    # robot.revolve_90_r()
    # time.sleep(0.5)
    # robot.move(last_time=2, vx=20000)
    # time.sleep(0.5)
    # robot.move(last_time=2, vy=-20000)
    # time.sleep(0.5)
    #
    # # ----------------------第二个箱子----------------------
    # # ----------------------fourth_仪表盘----------------------
    # robot.revolve_180()

























